; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	satellite5 - satellite
	instrument13 - instrument
	instrument14 - instrument
	image2 - mode
	image1 - mode
	thermograph0 - mode
	Star6 - direction
	GroundStation5 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	Star4 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 image2)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star4)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation2)
	(supports instrument3 image2)
	(calibration_target instrument3 Star6)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument4 thermograph0)
	(supports instrument4 image2)
	(calibration_target instrument4 GroundStation5)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation3)
	(calibration_target instrument5 GroundStation1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 GroundStation1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
	(supports instrument7 image1)
	(supports instrument7 image2)
	(calibration_target instrument7 GroundStation0)
	(calibration_target instrument7 GroundStation1)
	(supports instrument8 image1)
	(supports instrument8 image2)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 Star4)
	(calibration_target instrument8 GroundStation5)
	(supports instrument9 thermograph0)
	(supports instrument9 image2)
	(calibration_target instrument9 Star4)
	(calibration_target instrument9 GroundStation2)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation3)
	(supports instrument10 image2)
	(supports instrument10 image1)
	(calibration_target instrument10 GroundStation3)
	(calibration_target instrument10 GroundStation2)
	(supports instrument11 image1)
	(supports instrument11 image2)
	(calibration_target instrument11 GroundStation1)
	(supports instrument12 thermograph0)
	(calibration_target instrument12 GroundStation0)
	(calibration_target instrument12 GroundStation2)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star10)
	(supports instrument13 image1)
	(calibration_target instrument13 GroundStation2)
	(supports instrument14 thermograph0)
	(supports instrument14 image2)
	(supports instrument14 image1)
	(calibration_target instrument14 Star4)
	(on_board instrument13 satellite5)
	(on_board instrument14 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Planet9)
)
(:goal (and
	(pointing satellite1 GroundStation3)
	(pointing satellite3 Planet8)
	(pointing satellite4 Star7)
	(have_image Star7 image2)
	(have_image Planet8 image1)
	(have_image Planet9 thermograph0)
	(have_image Star10 image2)
	(have_image Planet11 thermograph0)
	(have_image Star12 thermograph0)
))

)

; plan
1. (turn_to satellite4 star7 star10)
   deleted: (pointing satellite4 star10)
   added: (pointing satellite4 star7)
   goals met: 1 of 9
2. (turn_to satellite3 groundstation5 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 groundstation5)
   goals met: 1 of 9
3. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 1 of 9
4. (calibrate satellite3 instrument8 groundstation5)
   added: (calibrated instrument8)
   goals met: 1 of 9
5. (turn_to satellite3 star10 groundstation5)
   deleted: (pointing satellite3 groundstation5)
   added: (pointing satellite3 star10)
   goals met: 1 of 9
6. (take_image satellite3 star10 instrument8 image2)
   added: (have_image star10 image2)
   goals met: 2 of 9
7. (turn_to satellite3 planet9 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 planet9)
   goals met: 2 of 9
8. (take_image satellite3 planet9 instrument8 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 3 of 9
9. (turn_to satellite3 planet11 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 planet11)
   goals met: 3 of 9
10. (turn_to satellite1 groundstation3 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 groundstation3)
   goals met: 4 of 9
11. (take_image satellite3 planet11 instrument8 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 5 of 9
12. (turn_to satellite3 star12 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 star12)
   goals met: 5 of 9
13. (take_image satellite3 star12 instrument8 thermograph0)
   added: (have_image star12 thermograph0)
   goals met: 6 of 9
14. (turn_to satellite3 star7 star12)
   deleted: (pointing satellite3 star12)
   added: (pointing satellite3 star7)
   goals met: 6 of 9
15. (take_image satellite3 star7 instrument8 image2)
   added: (have_image star7 image2)
   goals met: 7 of 9
16. (turn_to satellite3 planet8 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 planet8)
   goals met: 8 of 9
17. (take_image satellite3 planet8 instrument8 image1)
   added: (have_image planet8 image1)
   goals met: 9 of 9
